LEXICON_RU: dict[str, str] = {
    "member": "<b>Всеобщие приветики! 👋\n"
    "Я - PhotochallengeBot! 🤖</b>\n\n"
    'Со мной можно сыграть в игру "Фотоконкурс".\n'
    "Для запуска игры используйте команду /start@kts_photochallenge_bot",
    "beginning": "<b>Давайте сыграем в 'Фотоконкурс'? 📸</b>\n\n"
    "Чтобы узнать правила, используйте команду /help@kts_photochallenge_bot\n\n"
    "Для запуска игры требуется регистрация участников 🔻",
    "statistics": "<b>Общая таблица всех игроков:</b> 🏆\n\n{table}",
    "no statistics": "<b>К сожалению, статистика пуста.</b>\n\n"
    "Никто еще не принимал участие в игре."
    "Сыграйте скорее и исправьте это! 🎯",
    "statistics_button": "Игровая статистика 🥇",
    "registration": "<b>Здорово! Регистрируемся на участие!</b>\n\n"
    "Чтобы игра состоялась, нам потребуется <i>четное</i> количество игроков.\n\n"
    "Количество игроков: {players_num}",
    "gameplay": "Отлично!\n\nДавайте начинать раунд!",
    "start_round": "Игровой раунд запущен!\n\nГолосуем за участников!",
    "finish_round": "Друзья, голосуем за лучший, на ваш взгляд, аватар! 🙌\n\n"
    "Можно завершить раунд досрочно и перейти к следующему 🔻",
    "next_round": "Игровой раунд завершен! ✅",
    "finish_game": "Фух! Битва была не на шутку! Игра закончена!\n\n" "<b>Поздравляем @{username} с победой!!! 🥳</b>",
    "start_registration_button": "Начать регистрацию 📝",
    "user_register_button": "Зарегистрироваться ➕",
    "finish_registration_button": "Завершить регистрацию ✔",
    "play_round_button": "Сыграть раунд 🎲",
    "first_photo_button": "1️⃣",
    "first": "Победил игрок с первым фото! Поздравляем! 👏",
    "second_photo_button": "2️⃣",
    "second": "Победил игрок со вторым фото! Поздравляем! 👏",
    "draw": "Ничья!\n\nОба игрока продолжают участие в турнире! 😎",
    "zero_scores": "К сожалению, никто не проголосовал 🤐",
    "finish_round_button": "Завершить раунд ⛔",
    "next_round_button": "Следующий раунд ⏩",
    "exit_button": "Выйти из игры 🚪",
    "help": "<b>Правила игры:</b>\n\nВаш текущий аватар должен победить среди аватаров других игроков! 💪\n\n"
    "Игра проводится в несколько раундов - в зависимости от количества участников. "
    "Количество игроков обязательно должно быть четным. Для участия в конкурсе необходимо "
    "<i>зарегистрироваться</i>.\n\n"
    "В каждом раунде случайным образом будут выбраны два участника. Все игроки голосуют за наиболее "
    "понравившийся аватар. Голосовать могут только <i>зарегистрированные</i> участники. "
    "По итогам каждого раунда определяется победитель, который продолжает участие в конкурсе. "
    "Проигравший участник выбывает. В случае ничьи оба игрока продолжают свое участие. "
    "Игра продолжается до тех пор, пока не останется один победитель - всей игры!\n\n"
    "<b>Удачи в конкурсе! 😉</b>",
    "user_register_answer": "Игрок @{username} зарегистрирован!",
    "no_finish_registration": "К сожалению, вас меньше, чем нужно 😟\nПригласите минимум одного игрока!",
    "no_user_profile_photo": "У игрока @{username} нет аватара для игры 👽\n" "Регистрация, к сожалению, невозможна!",
    "success_vote": "Ваш голос принят!",
    "no_chance_to_vote": "Вы не можете голосовать повторно или не зарегистрированы",
}
